kokho1/Home-Defense-System-/esp32cam-face/sdkconfig.defaults
# ── Chip / Flash ────────────────────────────────────────────────────────
CONFIG_IDF_TARGET="esp32"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y

# ── PSRAM (required for camera frame buffers + face model) ───────────────
CONFIG_ESP32_SPIRAM_SUPPORT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y

# ── Camera frame buffer in PSRAM ─────────────────────────────────────────
CONFIG_CAMERA_GRAB_WHEN_EMPTY=y

# ── WiFi ─────────────────────────────────────────────────────────────────
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=4
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=8

# ── MQTT ─────────────────────────────────────────────────────────────────
CONFIG_MQTT_BUFFER_SIZE=1024
CONFIG_MQTT_TASK_STACK_SIZE=6144

# ── Task stack sizes (face pipeline is stack-hungry) ─────────────────────
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# ── Logging ──────────────────────────────────────────────────────────────
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
